Tekla Open API Reference for Tekla Structures 2025
ImageComboBox Events
The ImageComboBox type exposes the following members.
Events
Name | Description
ImageCBSelectedIndexChanged
 The ImageCBSelectedIndexChanged event is triggered just after the selected index has been changed in the image combo box.
Top
See Also
Reference
ImageComboBox Class
Tekla.Structures.Dialog.UIControls Namespace